espressif/esp-idf/components/soc/esp32c6/register/soc/hp_apm_struct.h
/** Type of region11_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** region11_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region11
         */
        uint32_t region11_addr_start:32;
    };
    uint32_t val;
} hp_apm_region11_addr_start_reg_t;

/** Type of region11_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** region11_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region11
         */
        uint32_t region11_addr_end:32;
    };
    uint32_t val;
} hp_apm_region11_addr_end_reg_t;

/** Type of region12_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** region12_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region12
         */
        uint32_t region12_addr_start:32;
    };
    uint32_t val;
} hp_apm_region12_addr_start_reg_t;

/** Type of region12_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** region12_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region12
         */
        uint32_t region12_addr_end:32;
    };
    uint32_t val;
} hp_apm_region12_addr_end_reg_t;

/** Type of region13_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** region13_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region13
         */
        uint32_t region13_addr_start:32;
    };
    uint32_t val;
} hp_apm_region13_addr_start_reg_t;

/** Type of region13_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** region13_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region13
         */
        uint32_t region13_addr_end:32;
    };
    uint32_t val;
} hp_apm_region13_addr_end_reg_t;

/** Type of region14_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** region14_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region14
         */
        uint32_t region14_addr_start:32;
    };
    uint32_t val;
} hp_apm_region14_addr_start_reg_t;

/** Type of region14_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** region14_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region14
         */
        uint32_t region14_addr_end:32;
    };
    uint32_t val;
} hp_apm_region14_addr_end_reg_t;

/** Type of region15_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** region15_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region15
         */
        uint32_t region15_addr_start:32;
    };
    uint32_t val;
} hp_apm_region15_addr_start_reg_t;

/** Type of region15_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** region15_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region15
         */
        uint32_t region15_addr_end:32;
    };
    uint32_t val;
} hp_apm_region15_addr_end_reg_t;


/** Group: Region access authority attribute register */
/** Type of region0_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region0_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region0_r0_pms_x:1;
        /** region0_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region0_r0_pms_w:1;
        /** region0_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region0_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region0_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region0_r1_pms_x:1;
        /** region0_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region0_r1_pms_w:1;
        /** region0_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region0_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region0_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region0_r2_pms_x:1;
        /** region0_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region0_r2_pms_w:1;
        /** region0_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region0_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region0_pms_attr_reg_t;

/** Type of region1_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region1_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region1_r0_pms_x:1;
        /** region1_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region1_r0_pms_w:1;
        /** region1_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region1_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region1_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region1_r1_pms_x:1;
        /** region1_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region1_r1_pms_w:1;
        /** region1_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region1_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region1_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region1_r2_pms_x:1;
        /** region1_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region1_r2_pms_w:1;
        /** region1_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region1_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region1_pms_attr_reg_t;

/** Type of region2_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region2_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region2_r0_pms_x:1;
        /** region2_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region2_r0_pms_w:1;
        /** region2_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region2_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region2_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region2_r1_pms_x:1;
        /** region2_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region2_r1_pms_w:1;
        /** region2_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region2_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region2_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region2_r2_pms_x:1;
        /** region2_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region2_r2_pms_w:1;
        /** region2_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region2_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region2_pms_attr_reg_t;

/** Type of region3_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region3_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region3_r0_pms_x:1;
        /** region3_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region3_r0_pms_w:1;
        /** region3_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region3_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region3_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region3_r1_pms_x:1;
        /** region3_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region3_r1_pms_w:1;
        /** region3_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region3_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region3_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region3_r2_pms_x:1;
        /** region3_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region3_r2_pms_w:1;
        /** region3_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region3_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region3_pms_attr_reg_t;

/** Type of region4_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region4_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region4_r0_pms_x:1;
        /** region4_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region4_r0_pms_w:1;
        /** region4_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region4_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region4_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region4_r1_pms_x:1;
        /** region4_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region4_r1_pms_w:1;
        /** region4_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region4_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region4_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region4_r2_pms_x:1;
        /** region4_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region4_r2_pms_w:1;
        /** region4_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region4_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region4_pms_attr_reg_t;

/** Type of region5_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region5_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region5_r0_pms_x:1;
        /** region5_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region5_r0_pms_w:1;
        /** region5_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region5_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region5_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region5_r1_pms_x:1;
        /** region5_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region5_r1_pms_w:1;
        /** region5_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region5_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region5_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region5_r2_pms_x:1;
        /** region5_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region5_r2_pms_w:1;
        /** region5_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region5_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region5_pms_attr_reg_t;

/** Type of region6_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region6_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region6_r0_pms_x:1;
        /** region6_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region6_r0_pms_w:1;
        /** region6_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region6_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region6_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region6_r1_pms_x:1;
        /** region6_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region6_r1_pms_w:1;
        /** region6_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region6_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region6_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region6_r2_pms_x:1;
        /** region6_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region6_r2_pms_w:1;
        /** region6_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region6_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region6_pms_attr_reg_t;

/** Type of region7_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region7_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region7_r0_pms_x:1;
        /** region7_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region7_r0_pms_w:1;
        /** region7_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region7_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region7_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region7_r1_pms_x:1;
        /** region7_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region7_r1_pms_w:1;
        /** region7_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region7_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region7_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region7_r2_pms_x:1;
        /** region7_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region7_r2_pms_w:1;
        /** region7_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region7_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region7_pms_attr_reg_t;

/** Type of region8_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region8_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region8_r0_pms_x:1;
        /** region8_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region8_r0_pms_w:1;
        /** region8_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region8_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region8_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region8_r1_pms_x:1;
        /** region8_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region8_r1_pms_w:1;
        /** region8_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region8_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region8_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region8_r2_pms_x:1;
        /** region8_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region8_r2_pms_w:1;
        /** region8_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region8_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region8_pms_attr_reg_t;

/** Type of region9_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** region9_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t region9_r0_pms_x:1;
        /** region9_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t region9_r0_pms_w:1;
        /** region9_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t region9_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** region9_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t region9_r1_pms_x:1;
        /** region9_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t region9_r1_pms_w:1;
        /** region9_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t region9_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** region9_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t region9_r2_pms_x:1;
        /** region9_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t region9_r2_pms_w:1;
        /** region9_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t region9_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region9_pms_attr_reg_t;

